Activating_FSI_Product_Notification/Activating_FSI_Notification.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" name="Activating_FSI_Notification" targetNamespace="http://VMTComponentModel/InterfaceSpecification/Interfaces/C4/IC4FSP2VMT" xmlns:c4="http://VMTComponentModel/InterfaceSpecification/Messages/C4/" xmlns:ic4="http://VMTComponentModel/InterfaceSpecification/Interfaces/C4/IC4FSP2VMT" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:documentation>
    <wsdl:appinfo source="WMQI_APPINFO">
      <MRWSDLAppInfo imported="true">
        <generatedXSD location="Activating_FSI_Notification_InlineSchema2.xsd"/>
        <generatedXSD location="Activating_FSI_Notification_InlineSchema1.xsd"/>
        <binding hasEncoding="false" imported="true" name="Activating_FSI_NotificationSOAP" originalBindingStyle="document"/>
      </MRWSDLAppInfo>
    </wsdl:appinfo>
  </wsdl:documentation>
  <wsdl:types>
    
    
          <xsd:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://VMTComponentModel/InterfaceSpecification/Messages/C4/">
<xsd:include schemaLocation="Activating_FSI_Notification_InlineSchema2.xsd"/>
    </xsd:schema>
        <xsd:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://VMTComponentModel/InterfaceSpecification/Interfaces/C4/IC4FSP2VMT" xmlns:ibmSchExtn="http://www.ibm.com/schema/extensions">
<xsd:import namespace="http://VMTComponentModel/InterfaceSpecification/Messages/C4/" schemaLocation="Activating_FSI_Notification_InlineSchema2.xsd"/>
<xsd:include schemaLocation="Activating_FSI_Notification_InlineSchema1.xsd"/>
    </xsd:schema>
    </wsdl:types>
  <wsdl:message name="FSPInitiatedActivateNotificationRequest">
    <wsdl:part element="ic4:FSPInitiatedActivateNotification" name="parameters"/>
  </wsdl:message>
  <wsdl:message name="FSPInitiatedActivateNotificationResponse">
    <wsdl:part element="ic4:FSPInitiatedActivateNotificationResponse" name="parameters"/>
  </wsdl:message>
  <wsdl:portType name="Activating_FSI_Notification">
    <wsdl:operation name="FSPInitiatedActivateNotification">
      <wsdl:input message="ic4:FSPInitiatedActivateNotificationRequest"/>
      <wsdl:output message="ic4:FSPInitiatedActivateNotificationResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="Activating_FSI_NotificationSOAP" type="ic4:Activating_FSI_Notification">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="FSPInitiatedActivateNotification">
      <soap:operation soapAction="http://VMTComponentModel/InterfaceSpecification/Interfaces/C4/IC4FSP2VMT/FSPInitiatedActivateNotification"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Activating_FSI_Notification">
    <wsdl:port binding="ic4:Activating_FSI_NotificationSOAP" name="Activating_FSI_NotificationSOAP">
      <soap:address location="http://127.0.0.1:7800/iib/cbemsl/activatingfsinotification"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>